In [1]:
import pandas as pd

In [2]:
data2=pd.read_excel(r"C:\Ganesh\Minskole Python Batch\input data.xlsx")

In [3]:
data2

   First Name Last Name  English  Physics  Chemistry  Mathematics
0       Aarav     Patil       85       78         90           92
1      Vihaan  Deshmukh       88       81         85           89
2       Ayaan    Jadhav       90       75         88           84
3       Arjun      More       76       89         91           78
4     Reyansh     Joshi       82       80         84           85
..        ...       ...      ...      ...        ...          ...
60      Tarun    Dhumal       82       87         81           85
61      Arnav   Khedkar       85       90         78           89
62      Payal     Patil       89       76         87           91
63      Rahul     Kadam       81       83         84           90
64        Jay    Bhagat       90       77         65           88

[65 rows x 6 columns]

In [ ]:
 1D:
variable[0] ==> First element 
2D
variable[0] ==> First row ==> Multiple value==> Slice
# variable[0,0] ==> First row ==> Simgle value==> Imdexing

Excel ==>2D
Indexing==> variable[row,column]

 Slicing data from the Pandas DataFrame:
 1) loc for label-based slicing:Selecting rows and columns using labels # last index included
 2) iloc for positional slicing:Selecting rows and columns by integer position # last index excluded
 3) at for quick access to single values
 4) iat for quick access to single values by position

In [ ]:
#     0   1  2   3
# 0
# 1
# 2
# 3

In [ ]:
# data2=pd.read_excel(r"C:\Ganesh\Minskole Python Batch\input data.xlsx")

In [ ]:
data2

In [5]:
data2.loc[0] # Select the first row using label

First Name     Aarav
Last Name      Patil
English           85
Physics           78
Chemistry         90
Mathematics       92
Name: 0, dtype: object

In [6]:
data2.loc[0:3]  # last index included

  First Name Last Name  English  Physics  Chemistry  Mathematics
0      Aarav     Patil       85       78         90           92
1     Vihaan  Deshmukh       88       81         85           89
2      Ayaan    Jadhav       90       75         88           84
3      Arjun      More       76       89         91           78

In [14]:
data3=data2.sort_values(by="Last Name")

In [9]:
data3=data2.rename(columns={"First Name":0})

In [18]:
data2.head(3)

  First Name Last Name  English  Physics  Chemistry  Mathematics
0      Aarav     Patil       85       78         90           92
1     Vihaan  Deshmukh       88       81         85           89
2      Ayaan    Jadhav       90       75         88           84

In [17]:
data3.head(3)

   First Name Last Name  English  Physics  Chemistry  Mathematics
64        Jay    Bhagat       90       77         65           88
41       Jaya    Bhagat       92       88         76           89
56      Aarvi  Bhandari       90       81         85           91

In [19]:
data2.loc[0]

First Name     Aarav
Last Name      Patil
English           85
Physics           78
Chemistry         90
Mathematics       92
Name: 0, dtype: object

In [20]:
data3.loc[0]

First Name     Aarav
Last Name      Patil
English           85
Physics           78
Chemistry         90
Mathematics       92
Name: 0, dtype: object

In [21]:
data3.iloc[0]

First Name        Jay
Last Name      Bhagat
English            90
Physics            77
Chemistry          65
Mathematics        88
Name: 64, dtype: object

In [23]:
data3.head(10)

   First Name  Last Name  English  Physics  Chemistry  Mathematics
64        Jay     Bhagat       90       77         65           88
41       Jaya     Bhagat       92       88         76           89
56      Aarvi   Bhandari       90       81         85           91
33      Aarvi   Bhandari       90       81         85           91
8       Krish    Bhosale       80       85         83           89
18      Krish    Bhosale       80       85         83           89
51      Disha     Chavan       86       83         80           89
28      Disha     Chavan       86       83         80           89
42      Misha  Choudhary       78       85         90           86
52     Shreya   Dandekar       89       75         88           90

In [25]:
data3.iloc[6]
#     index location   ===> Use by deafaulrt index start from 0

First Name      Disha
Last Name      Chavan
English            86
Physics            83
Chemistry          80
Mathematics        89
Name: 51, dtype: object

In [24]:
# 51	Disha	Chavan	86	83	80	89
data3.loc[28]
#   location   ===> Use by user defined

First Name      Disha
Last Name      Chavan
English            86
Physics            83
Chemistry          80
Mathematics        89
Name: 28, dtype: object

In [27]:
# Retrive multiple rows
data2.loc[0:4]

  First Name Last Name  English  Physics  Chemistry  Mathematics
0      Aarav     Patil       85       78         90           92
1     Vihaan  Deshmukh       88       81         85           89
2      Ayaan    Jadhav       90       75         88           84
3      Arjun      More       76       89         91           78
4    Reyansh     Joshi       82       80         84           85

In [10]:
data3.loc[0,0]

'Aarav'

In [12]:
data3.loc[3,0]

'Arjun'

In [29]:
data2.loc[0:4] # last index included

  First Name Last Name  English  Physics  Chemistry  Mathematics
0      Aarav     Patil       85       78         90           92
1     Vihaan  Deshmukh       88       81         85           89
2      Ayaan    Jadhav       90       75         88           84
3      Arjun      More       76       89         91           78
4    Reyansh     Joshi       82       80         84           85

In [30]:
data2.iloc[0:4] # last index exclude

  First Name Last Name  English  Physics  Chemistry  Mathematics
0      Aarav     Patil       85       78         90           92
1     Vihaan  Deshmukh       88       81         85           89
2      Ayaan    Jadhav       90       75         88           84
3      Arjun      More       76       89         91           78

In [31]:
data2.loc[0:4,["First Name","Last Name","Mathematics"]]

  First Name Last Name  Mathematics
0      Aarav     Patil           92
1     Vihaan  Deshmukh           89
2      Ayaan    Jadhav           84
3      Arjun      More           78
4    Reyansh     Joshi           85

In [ ]:
Excel ==>2D
Indexing==> variable[row,column]
3D
Indexing==> variable[Frame,row,column]

In [34]:
data2.iloc[0:4,[0,1,5]]
#          row   column

  First Name Last Name  Mathematics
0      Aarav     Patil           92
1     Vihaan  Deshmukh           89
2      Ayaan    Jadhav           84
3      Arjun      More           78

In [39]:
data2.loc[0:4][["First Name","Last Name"]]

  First Name Last Name
0      Aarav     Patil
1     Vihaan  Deshmukh
2      Ayaan    Jadhav
3      Arjun      More
4    Reyansh     Joshi

In [33]:
data2

   First Name Last Name  English  Physics  Chemistry  Mathematics
0       Aarav     Patil       85       78         90           92
1      Vihaan  Deshmukh       88       81         85           89
2       Ayaan    Jadhav       90       75         88           84
3       Arjun      More       76       89         91           78
4     Reyansh     Joshi       82       80         84           85
..        ...       ...      ...      ...        ...          ...
60      Tarun    Dhumal       82       87         81           85
61      Arnav   Khedkar       85       90         78           89
62      Payal     Patil       89       76         87           91
63      Rahul     Kadam       81       83         84           90
64        Jay    Bhagat       90       77         65           88

[65 rows x 6 columns]

In [ ]:
data2.loc[0:3]["First Name"]

In [ ]:
data2.loc[0:3][["First Name","Last Name"]]  # Select specific columns

In [ ]:
data2.loc[0:3 , ["First Name","Last Name"]]

In [ ]:
data2.loc[0:3 , [0:2]] # loc :label-based slicing:Selecting rows and columns using labels

In [ ]:
# iloc

In [ ]:
data2.iloc[0]  # positional slicing:Selecting rows and columns by integer position

In [ ]:
data3.iloc[0]

In [ ]:
data2.iloc[0:3] # last index excluded

In [ ]:
data2.iloc[0:3 , ["First Name","Last Name"]]

In [ ]:
data2.iloc[0:3 , 0:2]

In [ ]:
# at: Accessing a single value
data2.at[1, 'First Name']